package com.zhangyj.chapter02

/**
  * Desc: 强转面试题
128在scala中默认是Int类型，应该有32位
源码  00000000 00000000 00000000 10000000
补码  00000000 00000000 00000000 10000000
对Int数据进行截取，截取为Byte类型，剩8位    ==>10000000   约定当前值为范围最小值-128


130在scala中默认是Int类型，应该有32位
源码  00000000 00000000 00000000 10000010
补码  00000000 00000000 00000000 10000010
对Int数据进行截取，截取为Byte类型，剩8位    负数补码：10000010 -->反码：11111101-->源码：11111110


-130在scala中默认是Int类型，应该有32位
源码  10000000 00000000 00000000 10000010
反码  11111111 11111111 11111111 01111101
补码  11111111 11111111 11111111 01111110
对Int数据进行截取，截取为Byte类型，剩8位    正数补码：01111110 -->反码：01111110-->源码：01111110
  */
object Scala08_DataType {
  def main(args: Array[String]): Unit = {
    //var b:Byte = 128.toByte
    //var b:Byte = 130.toByte
    var b:Byte = (-130).toByte
    println(b)
  }
}
